# Standard Homebrew taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"

# Homebrew Formulae
# e.g. `brew install <program>`
# @brew [Act](https://github.com/nektos/act) - Run GitHub Actions locally
brew "act"
brew "curl"
brew "docker", when: linux
brew "goodwithtech/r/dockle"
brew "exiftool"
brew "gh"
brew "git"
brew "gitleaks"
brew "glab"
brew "go"
brew "jq"
brew "node"
brew "openssh"
brew "php", restart_service: true
brew "poetry"
brew "python"
brew "rsync"
brew "ruby"
brew "hudochenkov/sshpass/sshpass"
brew "tokei"
brew "aquasecurity/trivy/trivy"
brew "yarn"
brew "yq"
if OS.mac?
    brew "coreutils"
end

# Homebrew Casks (only available on macOS)
# e.g. `brew install --cask <program>`
# @cask [Docker](https://docker.com) - Description
cask "docker", when: macos
cask "firefox"
cask "google-chrome"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "slack"
cask "vagrant", when: macos
cask "virtualbox", when: macos
cask "visual-studio-code" unless ""
cask "vmware-fusion", when: macos

# Examples below
# 'brew install --with-rmtp', 'brew services restart' on version changes
# brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# 'brew install --cask'
# cask "google-chrome"
# 'brew install --cask --appdir=~/my-apps/Applications'
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# always upgrade auto-updated or unversioned cask to latest version even if already installed
# cask "opera", greedy: true
# 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
# cask "java" unless system "/usr/libexec/java_home --failfast"
# 'mas install'
# mas "1Password", id: 443987910
# 'whalebrew install'
# whalebrew "whalebrew/wget"
